src/toir_cf/src/InformationRegisters/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_СтатусыРемонтов/торо_СтатусыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_СтатусыРемонтов/торо_СтатусыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыРемонтов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>проф_КВыполнению</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/CommonModules/торо_ОбменMobileBrigadesСобытия/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.ФизическоеЛицо В(&ФизЛицо)";
		
		МассивФизЛиц = Новый Массив;
		Если ЗначениеЗаполнено(Источник.ФизическоеЛицо) Тогда
			МассивФизЛиц.Добавить(Источник.ФизическоеЛицо);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Ссылка)И ЗначениеЗаполнено(Источник.Ссылка.ФизическоеЛицо) Тогда
			МассивФизЛиц.Добавить(Источник.Ссылка.ФизическоеЛицо);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ФизЛицо", МассивФизЛиц);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Ссылка = Выборка.Ссылка;
				ОбъектСотрудник = Ссылка.ПолучитьОбъект();
				ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", ОбъектСотрудник, Отказ);
				
				Получатели = Новый Массив;
				Для Каждого Узел Из ОбъектСотрудник.ОбменДанными.Получатели Цикл
					Получатели.Добавить(Узел);
				КонецЦикла;
				
				Если Получатели.Количество() > 0 Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
			
	Иначе
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", Источник, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.торо_ИерархическиеСтруктурыОР") Тогда
		ЗарегистрироватьИзмененияОбъектаРемонтаПриЗаписиИерархии(Источник, Отказ, Замещение);
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.торо_РасположениеОРВСтруктуреИерархии") Тогда
		ЗарегистрироватьИзмененияОбъектаРемонтаПриЗаписиИерархииДокументами(Источник, Отказ, Замещение);
	Иначе
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("mobileBrigades", Источник, Отказ, Замещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеПриЗаписи(Источник, Отказ) Экспорт

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.торо_ЗаявкаНаРемонт") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		
		УстановитьПривилегированныйРежим(Истина);	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	mobileBrigades.Ссылка КАК Ссылка,
		               |	mobileBrigades.ИспользоватьЗаявки КАК ИспользоватьЗаявки
		               |ИЗ
		               |	ПланОбмена.mobileBrigades КАК mobileBrigades
		               |ГДЕ
		               |	mobileBrigades.ИспользоватьЗаявки = ИСТИНА
		               |	И НЕ mobileBrigades.Ссылка = &ЭтотУзел";
		
		
		ЭтотУзел = ПланыОбмена.mobileBrigades.ЭтотУзел();
		Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);
		
		Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Если Получатели.Количество() > 0 И ЗначениеЗаполнено(Источник.Ссылка) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Источник.Ссылка);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.торо_НарядНаРегламентноеМероприятие") Тогда
		
		УстановитьПривилегированныйРежим(Истина);	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	mobileBrigades.Ссылка КАК Ссылка,
		               |	mobileBrigades.ИспользоватьРегламентныеМероприятия КАК ИспользоватьРегламентныеМероприятия
		               |ИЗ
		               |	ПланОбмена.mobileBrigades КАК mobileBrigades
		               |ГДЕ
		               |	mobileBrigades.ИспользоватьРегламентныеМероприятия = ИСТИНА
		               |	И НЕ mobileBrigades.Ссылка = &ЭтотУзел";
		
		ЭтотУзел = ПланыОбмена.mobileBrigades.ЭтотУзел();
		Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);
		
		Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Если Получатели.Количество() > 0 И ЗначениеЗаполнено(Источник.Ссылка) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Источник.Ссылка);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли;
	
КонецПроцедуры

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("mobileBrigades", Источник, Отказ);
	
КонецПроцедуры

// Выполняет регистрацию заявок на ремонт, 
// которые должны прийти на устройство всвязи с изменением внешних (по отношению к заявкам)
// параметров: изменение подразделения, назначенного устройству; 
// изменение подразделения-исполнителя в объекте ремонта и др.
Процедура ЗарегистрироватьЗаявкиПриИзмененииПараметров(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("ИзменениеОР") 
		И СтруктураПараметров.ИзменениеОР = Истина
		И СтруктураПараметров.Свойство("ОбъектРемонта") Тогда
		
		Подразделение = СтруктураПараметров.ОбъектРемонта.ПодразделениеИсполнитель;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	mobileBrigades.Ссылка КАК Ссылка
			               |ИЗ
			               |	ПланОбмена.mobileBrigades КАК mobileBrigades
			               |ГДЕ
			               |	mobileBrigades.Подразделение = &Подразделение
			               |	И mobileBrigades.ИспользоватьЗаявки = ИСТИНА
			               |	И НЕ mobileBrigades.Ссылка = &ЭтотУзел";
			
			
			ЭтотУзел = ПланыОбмена.mobileBrigades.ЭтотУзел();
			Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			
			Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			Если Получатели.Количество() > 0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
				|ПОМЕСТИТЬ ВТ_ДанныеЗаявок
				|ИЗ
				|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
				|ГДЕ
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен = ИСТИНА
				|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Ссылка,
				|	ID
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент КАК Документ,
				|	торо_СтатусыДокументовСрезПоследних.Статус КАК СтатусДокумента
				|ПОМЕСТИТЬ ВТ_СтатусыДокументов
				|ИЗ
				|	РегистрСведений.торо_СтатусыДокументов.СрезПоследних(
				|			,
				|			ИзменяемыйДокумент В
				|				(ВЫБРАТЬ
				|					ВТ_ДанныеЗаявок.Ссылка КАК Ссылка
				|				ИЗ
				|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыДокументовСрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Документ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_СтатусыРемонтовСрезПоследних.IDРемонта КАК ИДРемонта,
				|	торо_СтатусыРемонтовСрезПоследних.Статус КАК Статус
				|ПОМЕСТИТЬ ВТ_СтатусыРемонтов
				|ИЗ
				|	РегистрСведений.торо_СтатусыРемонтов.СрезПоследних(
				|			,
				|			(IDРемонта) В
				|				(ВЫБРАТЬ
				|					ВТ_ДанныеЗаявок.ID КАК ID
				|				ИЗ
				|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыРемонтовСрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИДРемонта
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_ДанныеЗаявок.Ссылка КАК Ссылка
				|ИЗ
				|	ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыДокументов КАК ВТ_СтатусыДокументов
				|		ПО ВТ_ДанныеЗаявок.Ссылка = ВТ_СтатусыДокументов.Документ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыРемонтов КАК ВТ_СтатусыРемонтов
				|		ПО ВТ_ДанныеЗаявок.ID = ВТ_СтатусыРемонтов.ИДРемонта
				|ГДЕ
				|	НЕ ЕСТЬNULL(ВТ_СтатусыРемонтов.Статус, ВТ_СтатусыДокументов.СтатусДокумента) В (&СтатусВыполнен)";
				
				МассивВыполненныхСтатусов = Новый Массив;
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыРемонтов.Выполнен);
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыРемонтов.Отменен);
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Выполнен);
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Отклонен);
				
				Запрос.УстановитьПараметр("СтатусВыполнен", МассивВыполненныхСтатусов);
				Запрос.УстановитьПараметр("ОбъектРемонта", СтруктураПараметров.ОбъектРемонта);
				
				ВыборкаЗаявок = Запрос.Выполнить().Выбрать();
				
				Пока ВыборкаЗаявок.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(Получатели, ВыборкаЗаявок.Ссылка);
				КонецЦикла;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияОбъектаРемонтаПриЗаписиИерархии(НаборЗаписей, Отказ, Замещение)
	
	МассивОРДляРегистрации = Новый Массив;
	Если НаборЗаписей.Количество() > 0 Тогда
		Для каждого Запись из НаборЗаписей Цикл
			МассивОРДляРегистрации.Добавить(Запись.ОбъектИерархии); 
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(НаборЗаписей.Отбор.ОбъектИерархии.Значение) Тогда
			МассивОРДляРегистрации.Добавить(НаборЗаписей.Отбор.ОбъектИерархии.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ЗарегистрироватьИзмененияПоМассивуОбъектовРемонта(МассивОРДляРегистрации, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияОбъектаРемонтаПриЗаписиИерархииДокументами(НаборЗаписей, Отказ, Замещение)
	
	МассивОРДляРегистрации = Новый Массив;
	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение;
	
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросОРВСтаромНаборе = Новый Запрос;
	ЗапросОРВСтаромНаборе.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                              |	торо_РасположениеОРВСтруктуреИерархии.ОбъектИерархии КАК ОбъектИерархии
	                              |ИЗ
	                              |	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии КАК торо_РасположениеОРВСтруктуреИерархии
	                              |ГДЕ
	                              |	торо_РасположениеОРВСтруктуреИерархии.Регистратор = &Регистратор";
	
	ЗапросОРВСтаромНаборе.УстановитьПараметр("Регистратор", Регистратор);
	ВыборкаОРВстаровНаборе = ЗапросОРВСтаромНаборе.Выполнить().Выбрать();
	
	Пока ВыборкаОРВстаровНаборе.Следующий() Цикл
		МассивОРДляРегистрации.Добавить(ВыборкаОРВстаровНаборе.ОбъектИерархии);
	КонецЦикла;
	
	Для каждого Запись из НаборЗаписей Цикл
		Если МассивОРДляРегистрации.Найти(Запись.ОбъектИерархии) = Неопределено Тогда
			МассивОРДляРегистрации.Добавить(Запись.ОбъектИерархии);
		КонецЕсли;
	КонецЦикла;
	
	ЗарегистрироватьИзмененияПоМассивуОбъектовРемонта(МассивОРДляРегистрации, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПоМассивуОбъектовРемонта(МассивОР, Отказ)
	
	Если МассивОР.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	mobileBrigades.Ссылка КАК Ссылка,
	               |	mobileBrigades.ИспользоватьЗаявки КАК ИспользоватьЗаявки
	               |ИЗ
	               |	ПланОбмена.mobileBrigades КАК mobileBrigades
	               |ГДЕ
	               |	НЕ mobileBrigades.ПометкаУдаления
	               |	И НЕ mobileBrigades.Ссылка = &ЭтотУзел";
	
	ЭтотУзел = ПланыОбмена.mobileBrigades.ЭтотУзел();
	Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);

	Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если Получатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОбъектРемонта из МассивОР Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Получатели, ОбъектРемонта);
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти
